test/loadTest.yml
config:
  target: "http://localhost:2612"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/signup"
          json:
            info: {
        "name": "vaiditya1",
        "email": "vaidityatanwar12207@gmail.comdaafsfas",
        "username": "somethingdassa1fsfa",
        "phone-number": 9256225327,
        "verified": true,
        "friends" : [],
        "platforms": {
            "leetcode" : "username",
            "codeforces": "sadsdsadusername",
            "codechef": "username",
            "hackerrank": "username",
            "hackerearth": "username",
            "codedrills": "username"
        },
        "linkedin": "linkToLinkedIn",
        "github": "linkToGitHub"
    }
            password: "testpassword"